{
  "version": "1.0.12",
  "date": "2026-01-18",
  "downloadUrl": "https://github.com/DragisaGitHub/pausaler-app/releases/latest/download/Paushaler-setup.exe",
  "releasedAt": "2026-01-18T00:00:00Z",
  "notes": [
    "SR:",
    "• Ispravljena kritična greška u Backup/Restore mehanizmu vezana za SQLite WAL režim rada.",
    "• Backup sada uvek izvršava WAL checkpoint (TRUNCATE) pre pravljenja arhive, čime se garantuje da su sve izmene (uključujući obrisane fakture i licencu) trajno upisane u pausaler.db.",
    "• Backup arhiva sada sadrži isključivo pausaler.db i metadata.json (bez -wal / -shm fajlova), što obezbeđuje deterministički i pouzdan restore.",
    "• Restore proces je dodatno stabilizovan: brišu se svi WAL/SHM fajlovi i baza se zamenjuje atomarno.",
    "• Ispravljeno ponašanje gde su se nakon restore-a vraćali obrisani podaci ili gubila licenca.",
    "• Jasno obaveštenje u UI-ju da će se aplikacija ugasiti nakon Restore operacije i da je potrebno ručno je ponovo pokrenuti.",
    "• Termin \"Backup\" je u potpunosti preveden kao \"Rezervna kopija\" u srpskoj lokalizaciji.",
    "",

    "EN:",
    "• Fixed a critical Backup/Restore issue related to SQLite WAL mode.",
    "• Backup now always performs a WAL checkpoint (TRUNCATE) before archiving, ensuring all changes (including deleted invoices and license data) are permanently written to pausaler.db.",
    "• Backup archives now contain only pausaler.db and metadata.json (no -wal / -shm files), ensuring deterministic and reliable restores.",
    "• Restore process further hardened: all WAL/SHM files are removed and the database is replaced atomically.",
    "• Fixed an issue where deleted data reappeared or license information was lost after restore.",
    "• UI now clearly informs users that the app will close after Restore and must be started again manually.",
    "• Terminology improved and fully localized across Backup/Restore screens (SR/EN)."
  ],
  "windows": {
    "nsis": "https://github.com/DragisaGitHub/pausaler-app/releases/latest/download/Paushaler-setup.exe",
    "msi": "https://github.com/DragisaGitHub/pausaler-app/releases/latest/download/Paushaler.msi"
  }
}